src_doc/InformationRegisters/НастройкиДоступностиДляВидовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДоступностиДляВидовДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаДоступностиПоСостоянию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиДоступностиПоСостоянию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаименованияОписанияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/Catalogs/НастройкиДоступностиПоСостоянию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиДоступностиПоСостоянию</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиДляВидовДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНастройкиДоступностиДляВидовДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользоватьДля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектыКонтейнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/InformationRegisters/НастройкиДоступностиДляВидовДокументов/Forms/НастройкиПоВидуДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВидДокумента) Тогда
		Заголовок = СтрШаблон(НСтр(
			"ru = 'Настройки доступности по состоянию для вида документа ""%1""'"),
			Параметры.ВидДокумента);
		ВидыДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.ВидДокумента);

	ИначеЕсли ЗначениеЗаполнено(Параметры.ВидДействия) Тогда
		Заголовок = СтрШаблон(НСтр(
			"ru = 'Настройки доступности по состоянию для вида действия ""%1""'"),
			Параметры.ВидДействия);
		ВидыДокументов = Справочники.НастройкиОбработкиВидовОбъектов.ВидыОбъектовПоВидуДействия(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.ВидДействия));
	Иначе
		ВидыДокументов = Новый Массив;

	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиДоступностиПоСостоянию.Ссылка КАК НастройкаДоступностиПоСостоянию
		|ИЗ
		|	Справочник.НастройкиДоступностиПоСостоянию КАК НастройкиДоступностиПоСостоянию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиДоступностиДляВидовДокументов КАК
		|			РегистрСведенийНастройкиДоступностиДляВидовДокументов
		|		ПО НастройкиДоступностиПоСостоянию.Ссылка = РегистрСведенийНастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию
		|ГДЕ
		|	НЕ НастройкиДоступностиПоСостоянию.ПометкаУдаления
		|	И НастройкиДоступностиПоСостоянию.ТипДокумента = &ТипДокумента
		|	И РегистрСведенийНастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрСведенийНастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию
		|ИЗ
		|	РегистрСведений.НастройкиДоступностиДляВидовДокументов КАК РегистрСведенийНастройкиДоступностиДляВидовДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиДоступностиПоСостоянию КАК НастройкиДоступностиПоСостоянию
		|		ПО РегистрСведенийНастройкиДоступностиДляВидовДокументов.НастройкаДоступностиПоСостоянию = НастройкиДоступностиПоСостоянию.Ссылка
		|		И Не НастройкиДоступностиПоСостоянию.ПометкаУдаления И НастройкиДоступностиПоСостоянию.ТипДокумента = &ТипДокумента
		|ГДЕ
		|	РегистрСведенийНастройкиДоступностиДляВидовДокументов.ВидДокумента В (&ВидДокумента)";
		
	Запрос.Параметры.Вставить("ТипДокумента", Перечисления.ТипыОбъектов.ДокументыПредприятия);
	Запрос.Параметры.Вставить("ВидДокумента", ВидыДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяСтрока = СписокНастроек.Добавить();
		НоваяСтрока.НастройкаДоступностиПоСостоянию = Выборка.НастройкаДоступностиПоСостоянию;
		
		УчастникиДляСписка = Новый Массив;
		Для Каждого Строка Из Выборка.НастройкаДоступностиПоСостоянию.ИспользоватьДля Цикл 
			УчастникиДляСписка.Добавить(Строка.Участник);
		КонецЦикла;
		НоваяСтрока.Участники = СтрСоединить(УчастникиДляСписка, ", ");
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНастроек

&НаКлиенте
Процедура СписокНастроекПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(Параметры.ВидДокумента) Тогда 
		ПараметрыОткрытия.Вставить("ВидДокумента", Параметры.ВидДокумента);
	ИначеЕсли ЗначениеЗаполнено(Параметры.ВидДействия) Тогда
		ПараметрыОткрытия.Вставить("ВидДействия", Параметры.ВидДействия);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.НастройкаДоступностиПоСостоянию);
	
	КлючеваяОперация = ДелопроизводствоКлиентСервер.КлючеваяОперацияОткрытиеНДПС();
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	ОткрытьФорму("Справочник.НастройкиДоступностиПоСостоянию.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
